Revit 2027 API
BRepBuilderGeometryId.InvalidGeometryId Method
 Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BRepBuilderGeometryId InvalidGeometryId()
Public Shared Function InvalidGeometryId As BRepBuilderGeometryId
public:
static BRepBuilderGeometryId^ InvalidGeometryId()
static member InvalidGeometryId : unit -> BRepBuilderGeometryId
Return Value
BRepBuilderGeometryId
See Also
Reference
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace